Repository: lawrancej/logisim
Catalog: xlate/ru/doc/omegat-logisim-doc_ru-omegat.tmx
Source language: en
Languages: ru_ru

source: In addition, the left-arrow and right-arrow keys move the cursor within the buffer, and the delete key deletes the character to the right of the cursor (if any).
ru_ru: В дополнение, клавиши стрелка влево и стрелка вправо перемещают курсор внутри буфера и клавиша Delete удаляет символ справа от курсора (если он есть).

source: The font to use when drawing the label.
ru_ru: Шрифт, используемый при отрисовке метки.

source: announcement including an appropriate copyright notice and a
ru_ru: объявление, содержащее соответствующее уведомление об авторских правах и

source: West edge, south end (input, bit width is computed as below)
ru_ru: Западный край, южный конец (вход, разрядность вычисляется как указано ниже)

source: Determines whether the transistor is P-type or N-type.
ru_ru: Определяет тип транзистора: p-тип или n-тип.

source: While in the subcircuit, you are allowed to alter the circuit.
ru_ru: Когда вы находитесь внутри состояния подсхемы, вы можете изменять схему.

source: When the value on this pin is 1, then the component behaves just like the respective component (a buffer or a inverter (NOT gate)).
ru_ru: Когда значение на этом контакте 1, компонент ведёт себя просто как соответствующий компонент (буфер или инвертор (элемент НЕ)).

source: Application Preferences
ru_ru: Настройки приложения

source: If the divisor is 0, then no division is performed (i.e., the divisor is assumed to be 1).
ru_ru: Если делитель равен 0, то деление не выполняется (т.е. предполагается, что делитель равен 1).

source: GNU GENERAL PUBLIC LICENSE Version 2, June 1991
ru_ru: УНИВЕРСАЛЬНАЯ ОБЩЕСТВЕННАЯ ЛИЦЕНЗИЯ GNU Версия 2, июнь 1991 г.

source: The component's output, which will match the source input if p-gate is 0 and n-gate is 1, or it will be floating if p-gate is 1 and n-gate is 0.
ru_ru: Выход компонента, значение на котором будет совпадать со значением на входе исток, если на p-затворе 0 и на n-затворе 1, или будет плавающим, если на p-затворе 1 и наn-затворе 0.

source: Group Signal: 1 if the component is enabled and at least one indexed input has a value of 1; otherwise this output is 0.
ru_ru: Сигнал для группировки: 1, если компонент включен и хотя бы один нумерованный вход содержит 1; иначе на этом выходе 0.

source: Sometimes you can avoid twiddling each individual Bit x attribute by bringing up the pop-up menu for a splitter (usually by right-clicking or control-clicking it).
ru_ru: Иногда вы можете избежать настройки каждого отдельного атрибута "Бит x", вызвав для разветвителя всплывающее меню (обычно с помощью щелчка правой кнопки мыши или щелчка левой кнопкой с зажатой клавишей Control).

source: The GPL restrictions do apply, however, if portions of your work are derived from portions of Logisim source code (released under the GPL).
ru_ru: Ограничения GPL применяются, однако, если часть вашей работы основана на исходном коде Logisim (выпущенного под GPL).

source: // instances that appear in any circuits.
ru_ru: // экземплярами, появляющимися во всех схемах.

source: Pull Direction
ru_ru: Направление согласования

source: All
ru_ru: Весь

source: These preferences enable features that are considered experimental, inserted to garner user feedback.
ru_ru: Эти настройки включают возможности, которые считаются экспериментальными, включенные для налаживания обратной связи с пользователями.

source: But electronics designers find Gray codes useful sometimes.
ru_ru: Но разработчики электроники иногда находят код Грея полезным.

source: Input values, indexed from 0 at the top/west end of the edge.
ru_ru: Входные значения, нумерованные с 0 на верхнем/западном конце края.

source: You can configure many of Logisim's application preferences via command line options.
ru_ru: Вы можете изменять многие настройки приложения Logisim через параметры командной строки.

source: Indeed, a wire can carry values in both directions simultaneously; the center wire in the below example is doing this.
ru_ru: Действительно, провод может передавать значения в обоих направлениях одновременно; центральный провод в примере ниже делает это.

source: Logisim cannot simulate subcircuits whose pins sometimes behave as inputs and sometimes behave as outputs.
ru_ru: Logisim не может моделировать подсхемы, чьи контакты иногда ведут себя как входы, а иногда - как выходы.

source: Next: The Selection tab.
ru_ru: Далее: Вкладка Выбор.

source: You can edit either the truth table or the expression; the other will automatically change as necessary to keep them consistent.
ru_ru: Вы можете редактировать и таблицу истинности и выражение; одно будет автоматически менять другое по мере необходимости, чтобы они соответствовали друг другу.

source: North edge, labeled upper (input, bit width matches Data Bits attribute)
ru_ru: Северный край, отмечен upper (вход, разрядность соответствует атрибуту Биты данных)

source: In this example, the component placing a value onto the wire is a three-state pin, so it can emit this floating value.
ru_ru: В этом примере компонент, передающий значение проводу - контакт с тремя состояниями, поэтому он выдаёт это плавающее значение.

source: The File menu allows this, and of course it also allows you to exit Logisim.
ru_ru: Меню Файл позволяет сделать это, и, конечно, оно также позволяет выйти из Logisim.

source: AND
ru_ru: И

source: Once you have completed viewing and/or editing, you can return to the parent circuit either by double-clicking the parent circuit in the explorer pane, or via the Go Out To State submenu of the Simulate menu.
ru_ru: После завершения просмотра и/или редактирования, вы можете вернуться к родительской схеме либо двойным щелчком мыши на ней в панели проводника, либо через подменю Состояние уровнем выше из меню Моделировать.

source: East edge (output, bit width computed as described below)
ru_ru: Восточный край (выход, разрядность вычисляется как описано ниже)

source: // customized icon representing the component type.
ru_ru: // определённый значок, представляющий тип компонента.

source: Copyright notice
ru_ru: Уведомление об авторских правах

source: For instance, given input 0100 the output is 1100.
ru_ru: Например, при входном значении 0100 на выходе будет 1100.

source: The text within the label associated with the flip-flop.
ru_ru: Текст внутри метки, привязанной к триггеру.

source: This time, they will be narrow.
ru_ru: На этот раз они будут узкими.

source: On selecting a file, file logging will automatically start.
ru_ru: После выбора файла запись в журнал начнётся автоматически.

source: // This is the same as with SimpleGrayCounter, except that we use the
ru_ru: // Это так же, как и с SimpleGrayCounter, кроме того, что мы используем

source: If the Program does not specify a version number of this License, you may choose any version ever published by the Free Software Foundation.
ru_ru: Если в Программе не указан номер версии данной Лицензии, вы можете выбрать любую версию, когда-либо опубликованную Фондом Свободного ПО.

source: South edge, first from left (input, bit width 4)
ru_ru: Южный край, первый слева (вход, разрядность равна 4)

source: During the drag, the shortening is indicated by drawing a white line over of the portion of the wire that will be removed.
ru_ru: Пока вы перетаскиваете, укорачивание отображается с помощью отрисовки белой линии поверх той части провода, которая будет удалена.

source: The Selection tab
ru_ru: Вкладка Выбор

source: Next: Step 3: Adding text
ru_ru: Далее: Шаг 3: Добавление текста

source: The bit width is the minimum number of bits to store the maximum possible index, which is one less than the value of the Data Bits attribute.
ru_ru: Разрядность - минимальное количество бит для хранения максимально возможного номера, который на единицу меньше, чем значение атрибута Биты данных.

source: This component adds two values coming in via the west inputs and outputs the sum on the east output.
ru_ru: Этот компонент складывает два значения, поступающие на западные входы и выдаёт сумму на восточный выход.

source: Also, for each author's protection and ours, we want to make certain that everyone understands that there is no warranty for this free software.
ru_ru: Также, чтобы защитить нас и каждого автора, мы хотим удостовериться, что все понимают, что гарантий на это свободное ПО нет.

source: At bottom you can control whether a header line should be placed into the file indicating which items are in the selection.
ru_ru: Внизу вы можете контролировать, должна ли быть добавлена в файл строка заголовка, указывающая, какие элементы выбраны.

source: Addresses displayed are listed in gray to the left of the display area.
ru_ru: Их адреса перечислены серым слева от области отображения.

source: This "obviously" always outputs 0.
ru_ru: Она "очевидно" всегда даёт 0 на выходе.

source: The behavior when the counter attempts to increment beyond the maximum value or decrement beyond 0.
ru_ru: Поведение, когда счётчик пытается увеличится при максимальном значении, или уменьшиться при 0.

source: Building comparison into the circuit
ru_ru: Встраивание сравнения в схему

source: Logging
ru_ru: Запись в журнал

source: The Facing attribute tells where the split ends should be relative to the combined end.
ru_ru: Атрибут Направление говорит о том, где должны быть разъединённые концы по отношению к объединённому концу.

source: Thus, the output will be 10EE: The upper two bits will be 1 and 0 since all integers between 9 and 11 have 1 and 0 as their top two bits, but the lower two bits are EE since integers between 9 and 11 vary within these bits.
ru_ru: Таким образом, на выходе будет 10EE: старшие два бита будут 1 и 0, так как все целые числа между 9 и 11 имеют 1 и 0 в качестве верхних двух битов, а два младших бита - EE, поскольку целые числа от 9 до 11 имеют разные комбинации этих битов.

source: Minimize
ru_ru: Минимизировать

source: By default this is on — though it can be turned off temporarily by pressing the shift key while moving the components.
ru_ru: По умолчанию он включен - хотя он может быть временно отключен нажатием клавиши Shift при перемещении компонентов.

source: Next: The Table tab.
ru_ru: Далее: Вкладка Таблица.

source: Any
ru_ru: С любой

source: XOR
ru_ru: Исключающее ИЛИ

source: Next: The Template tab.
ru_ru: Далее: Вкладка Шаблон.

source: Next: The explorer pane.
ru_ru: Далее: Панель проводника.

source: Include Enable?
ru_ru: Разрешающий вход?

source: And the third way is to first ensure the Poke Tool is selected and then click the subcircuit you want to enter; a magnifying glass will appear over the subcircuit's center, and double-clicking the magnifying glass will enter the subcircuit's state.
ru_ru: И третий способ - убедиться, что выбран Инструмент Нажатие, и затем щёлкнуть на схеме, в которую вы хотите проникнуть; над её центром появится увеличительное стекло; двойной щелчок на увеличительном стекле позволит вам проникнуть в состояние подсхемы.

source: Buffer
ru_ru: Буфер

source: * libraries contain tools, which is a slightly more general concept
ru_ru: * библиотеки содержат инструменты, являющиеся несколько более общим понятием,

source: (The bits at indices 0 and 1 are both 0.) For the highest-order 1, the output is 7 because the topmost 1 bit is at index 7 (again counting from the lowest-order bit as 0).
ru_ru: (Биты с номерами 0 и 1 оба равны 0.) Для старшего 1 на выходе 7, потому что самый верхний бит 1 - под номером 7 (опять же, считая самый младший бит нулевым).

source: // attributes allow us to associate a label with the component (though
ru_ru: // атрибута позволяют нам связать метку с компонентом (однако,

source: If you want to add a copy of the recently placed component, a shortcut is to press Control-D to duplicate the selection.
ru_ru: Если вы хотите добавить копию недавно размещённого компонента, то быстрый вызов для этого - нажать Control-D для дублирования выделения.

source: Copy
ru_ru: Копировать

source: This occurs because the wire is not attached to any components' inputs and outputs.
ru_ru: Это происходит потому, что провод не подключен к каким-либо входам или выходам компонента.

source: The Build Circuit button will construct a circuit whose gates correspond to the currently chosen expressions for each output.
ru_ru: Кнопка Построить схему построит схему, элементы которой будут соответствовать выбранным в данный момент выражениям для каждого выхода.

source: individual window titles
ru_ru: названия отдельных окон

source: When you start Logisim, you'll see a window similar to the following.
ru_ru: Когда вы запустите Logisim, вы увидите окно, подобное следующему.

source: When the component is selected or being added, Alt-0 through Alt-9 alter its Data Bits attribute and the arrow keys alter its Facing attribute.
ru_ru: Когда компонент выбран, или уже добавлен, комбинации от Alt-0 до Alt-9 меняют его атрибут Биты данных, а клавиши со стрелками меняют его атрибут Направление.

source: * Logisim accesses first when it opens the JAR file: It looks for
ru_ru: * Logisim получает доступ в первую очередь, когда открывает JAR файл: он ищет

source: The number of values stored in ROM is 2addrBitWidth.
ru_ru: Количество значений, хранящихся в ПЗУ равно 2Разрядность_адреса.

source: To protect your rights, we need to make restrictions that forbid anyone to deny you these rights or to ask you to surrender the rights.
ru_ru: Чтобы защитить ваши права, нам нужно ввести такие ограничения, которые запретят кому бы то ни было отказывать вам в этих правах или потребовать от вас отказаться от этих прав.

source: After the simulation ends, a one-line message is displayed explaining why the simulation ended.
ru_ru: После окончания моделирования выводится сообщение из одной строки, объясняющее, почему кончилось моделирование.

source: The Right-handed option is the same except the spine goes right (if you're facing according to the Facing attribute).
ru_ru: Вариант Праворукий - то же самое, за исключением того, что стержень уходит направо (если вы смотрите в направлении, соответствующем атрибуту Направление).

source: Indicates knob's x-coordinate, to be interpreted as an unsigned integer whose value will never be 0.
ru_ru: Указывает x координату рукоятки, значение на нём следует интерпретировать как беззнаковое целое, которое никогда не может быть 0.

source: That JAR file also contains the source code contained in these examples.
ru_ru: Этот JAR файл также содержит исходный код, содержащийся в этих примерах.

source: 1 if the first input is less than the second input, 0 if the first input is greater than or equal the second input.
ru_ru: На этом выходе 1, если значение на первом входе меньше, чем на втором, и 0, если больше или равно.

source: South edge, leftmost pin (input, bit width 1)
ru_ru: Южный край, левый контакт (вход, разрядность равна 1)

source: Logisim's behavior when duplicating a selection or pasting the clipboard into a circuit is somewhat peculiar: It will not immediately place the components into the circuit; instead, the selection will be a collection of "ghosts," which will be dropped into the circuit as soon as they are either dragged to another location or removed from the selection.
ru_ru: Поведение Logisim при дублировании выделения или вставке из буфера обмена в схему несколько своеобразно: он не сразу поместит компоненты в схему; вместо этого выделение будет состоять из набора "призраков", которые будут добавлены в схему, как только они либо будут перетащены в другое место, либо удалены из выделения.

source: The circle option is more difficult to interpret, but it more closely approximates the off-the-shelf LED matrix components.
ru_ru: Вариант Круглая более сложен для распознавания, но он более приближен к имеющимся в продаже светодиодным матрицам.

source: Next: User's Guide
ru_ru: Далее: Руководство пользователя

source: The value to negate.
ru_ru: Значение для отрицания.

source: Combinational Analysis
ru_ru: Комбинационный анализ

source: Welcome to Logisim!
ru_ru: Добро пожаловать в Logisim!

source: (Note that if the pin component is an input pin, then the pin that acts as its interface within the circuit will be an output, and vice versa.)
ru_ru: (Заметьте, что если компонент Контакт - входной контакт, то контакт, который выступает в качестве интерфейса в схеме, будет выходом, и наоборот.)

source: * relative to the mouse location.
ru_ru: * относительно положения мыши.

source: These restrictions translate to certain responsibilities for you if you distribute copies of the software, or if you modify it.
ru_ru: Эти ограничения переводятся в некоторые обязательства для вас, если вы распространяете копии ПО или если вы модифицируете его.

source: Add Vertex
ru_ru: Добавить вершину

source: Controls the decimal point.
ru_ru: Управляет десятичной точкой.

source: These values will look wrong - in this screen shot, the AND gate is emitting 1 although one of its inputs is 0, but it could be that the NOT gate has a 1 input and a 1 output.
ru_ru: Эти значения будут выглядеть неправильными - на этом снимке экрана элемент И выдаёт 1, хотя на одном из его входов 0; или может быть, что у элемента НЕ на входе и на выходе 1.

source: Combined end (input/output bit width matches Bit Width In attribute)
ru_ru: Объединённый конец (вход/выход, разрядность соответствует атрибуту Разрядность входа)

source: Depending on the value found at gate, the value at source may be transmitted to drain; or there may be no connection from source, so drain is left floating.
ru_ru: В зависимости от значения, поступающего на затвор, значение с истока может быть передано на сток; или соединения с истоком может не быть, тогда значение на стоке остаётся плавающим.

source: Pressing the mouse button while it is within a currently selected component begins a drag moving all components of the selection.
ru_ru: Нажатие кнопки мыши, пока она внутри выбранного в данный момент компонента, начинает перетаскивание всех компонентов выделения.

source: The only item under the Table tab is the current truth table, diagrammed in the conventional order, with inputs constituting the columns on the left and outputs constituting the columns on the right.
ru_ru: Единственный элемент на вкладке Таблица - это текущая таблица истинности, изображённая в привычном виде: входы составляют столбцы слева, а выходы составляют столбцы справа.

source: // individual instance's state.
ru_ru: // состоянием конкретного экземпляра.

source: Selects how many rows are in the matrix, which may range from 1 up to 32.
ru_ru: Определяет, сколько строк в матрице, может быть в диапазоне от 1 до 32.

source: The access point for the JAR library is a class that extends the Library class.
ru_ru: Точка доступа для JAR библиотеки - это класс, расширяющий класс Library.

source: Many menu items relate specifically to a currently opened project.
ru_ru: Многие пункты меню касаются конкретно открытого в данный момент проекта.

source: The text within the label associated with the component.
ru_ru: Текст внутри метки, привязанной к компоненту.

source: There is no way for a bit to correspond to multiple split ends.
ru_ru: Нет способа задать для бита соответствие нескольким разделённым концам.

source: Displays the application preferences window.
ru_ru: Отображает окно настроек приложения.

source: Most libraries, though, contain only tools for adding individual components; all built-in libraries other than the Base library are like this.
ru_ru: Большинство библиотек, однако, содержат лишь инструменты для добавления отдельных компонентов; все встроенные библиотеки, кроме библиотеки Базовые - как раз такие.

source: Load: When this 1, the values found on the other north-edge pins are loaded into all stages at the next clock trigger.
ru_ru: Загрузка: когда на этом входе 1, значения с остальных контактов на северном крае загружаются во все ступени при следующем срабатывании тактового входа.

source: The columns are ordered left-to-right according to the top-down ordering within the circuit.
ru_ru: Столбцы идут слева направо в порядке, соответствующем порядку сверху вниз в схеме.

source: Asynchronous reset: When 0 or undefined, this input has no effect.
ru_ru: Асинхронный сброс: если на этом входе 0 или неопределённое значение, то он не имеет эффекта.

source: Gates library
ru_ru: Библиотека Элементы

source: Preamble
ru_ru: Преамбула

source: The first parameter
ru_ru: Первый параметр

source: If you want to rename an existing input, select it in the list in the pane's upper left region; then type the name and click Rename.
ru_ru: Если вы хотите переименовать существующий вход, выберите его в списке в левой верхней области вкладки, а затем введите название и нажмите Переименовать.

source: About Gray codes
ru_ru: О коде Грея

source: Clicking the counter brings keyboard focus to the component (indicated by a red rectangle), and typing hexadecimal digits will change the value stored in the counter.
ru_ru: Нажатие на счётчике переводит фокус ввода клавиатуры на компонент (это отображается красным прямоугольником), и ввод шестнадцатеричных цифр будет менять значение, хранящееся в счётчике.

source: Rectangular
ru_ru: Прямоугольные

source: SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.
ru_ru: ЕСЛИ ПРОГРАММА ОКАЖЕТСЯ ДЕФЕКТИВНОЙ, ВЫ ПРИНИМАЕТЕ НА СЕБЯ СТОИМОСТЬ ВСЕГО НЕОБХОДИМОГО ОБСЛУЖИВАНИЯ, ВОССТАНОВЛЕНИЯ ИЛИ ИСПРАВЛЕНИЯ.

source: But
ru_ru: Но

source: By default, the circuit is represented as a rectangle with a gray notch on its north end, but this menu option allows you to draw a different appearance for the subcircuit.
ru_ru: По умолчанию схема представляется в виде прямоугольника с серой выемкой на северном крае, но этот пункт меню позволяет вам нарисовать другой внешний вид для подсхемы.

source: The number of input bits which are 1.
ru_ru: Количество входных битов, значение на которых равно 1.

source: Value propagation
ru_ru: Просчёт значений

source: From a window for editing circuits, you can also request that Logisim analyze the current circuit by selecting the Analyze Circuit option from the Project menu.
ru_ru: Из окна для редактирования схем вы также можете запросить Logisim анализировать текущую схему, выбрав пункт Анализировать схему из меню Проект.

source: If you haven't viewed the window before, the opened window will represent no circuit at all.
ru_ru: Если вы ещё не рассматривали это окно прежде, открытое окно не будет представлять никакой схемы.

source: // Here I retrieve the state associated with this component via a helper
ru_ru: // Здесь я получаю состояние, связанное с этим компонентом через вспомогательный

source: Odd
ru_ru: Нечётность

source: West edge, bottom pin marked with triangle (input, bit width 1)
ru_ru: Западный край, нижний контакт, отмечен треугольником (вход, разрядность равна 1)

source: Suppose we want to build a 2-to-1 multiplexer named "2:1 MUX." After adding the circuit, Logisim will look like this.
ru_ru: Допустим, мы хотим построить мультиплексор 2-в-1 с названием "2:1 MUX". После добавления схемы Logisim будет выглядеть следующим образом.

source: Ports corresponding to inputs are drawn as squares, while ports corresponding to outputs are drawn as circles.
ru_ru: Порты, соответствующие входам, отрисованы в виде прямоугольников, а соответствующие выходам - в виде кругов.

source: Exactly when the clock input indicates for this to happen is configured via the Trigger attribute.
ru_ru: Когда конкретно тактовый вход указывает этому случиться, настраивается атрибутом Срабатывание.

source: It has three possible values.
ru_ru: Он имеет три возможных значения.

source: Output Bits
ru_ru: Выходные биты
